//------------------------------------------------------
// @brief	ｷｬﾗｸﾀｰ選択画面
// 2020 5/7 Ryosuke Iida
//------------------------------------------------------

#include "CharSelScene.h"
#include <DxLib.h>

//------------------------------------------------------
// @brief	ｺﾝｽﾄﾗｸﾀ
//------------------------------------------------------
CharSelScene::CharSelScene(ISceneSwitcher* switcher)
	: BaseScene(switcher)
{
	// 処理なし
}

//------------------------------------------------------
// @brief	ﾃﾞｽﾄﾗｸﾀ
//------------------------------------------------------
CharSelScene::~CharSelScene()
{
	// 処理なし
}

//------------------------------------------------------
// @brief	更新
//------------------------------------------------------
void CharSelScene::Update(const Controller& controll)
{

	// ﾃﾞﾊﾞｯｸﾞ用ｼｰﾝ切り替えｷｰ:Q
	if (CheckHitKey(KEY_INPUT_Q) != 0) {
		// ｽﾃｰｼﾞ選択画面に切り替え
		sceneSwitcher->SwitchScene(eScene_StageSel);
	}
}

//------------------------------------------------------
// @brief	描画
//------------------------------------------------------
void CharSelScene::Draw(void)
{
	DrawString(0, 0, "ｷｬﾗｸﾀｰ選択画面", 0xffffff);
}