//------------------------------------------------------
// @brief	¹Þ°Ñ‰æ–Ê
// 2020 5/7 Ryosuke Iida
//------------------------------------------------------

#include <DxLib.h>
#include "GameScene.h"
#include "Camera.h"

//------------------------------------------------------
// @brief	ºÝ½Ä×¸À
//------------------------------------------------------
GameScene::GameScene(ISceneSwitcher* switcher)
	: BaseScene(switcher)
{

}

//------------------------------------------------------
// @brief	ÃÞ½Ä×¸À
//------------------------------------------------------
GameScene::~GameScene()
{
}

//------------------------------------------------------
// @brief	XV
//------------------------------------------------------
void GameScene::Update(const Controller& controll)
{

	// ÃÞÊÞ¯¸Þ—p¼°ÝØ‚è‘Ö‚¦·°:Q
	if (CheckHitKey(KEY_INPUT_Y) == 1) {
		// À²ÄÙ‰æ–Ê‚ÉØ‚è‘Ö‚¦
		sceneSwitcher->SwitchScene(eScene_Title);
	}
}

//------------------------------------------------------
// @brief	•`‰æ
//------------------------------------------------------
void GameScene::Render()
{
	DrawString(0, 0, "¹Þ°Ñ‰æ–Ê", 0xffffff);
}