//------------------------------------------------------
// @brief	ｹﾞｰﾑ自体の初期化、ﾌﾛｰ、終了
// 2020 5/7 Ryosuke Iida
//------------------------------------------------------

#include <assert.h>
#include <DxLib.h>
#include "GameTask.h"
#include "SceneManager.h"

//------------------------------------------------------
// @brief	ｺﾝｽﾄﾗｸﾀ
//------------------------------------------------------
GameTask::GameTask()
	: sceneManager(NULL)
{
	// 処理なし
}

//------------------------------------------------------
// @brief	ﾃﾞｽﾄﾗｸﾀ
//------------------------------------------------------
GameTask::~GameTask()
{
	// 異常終了のﾁｪｯｸ
	assert(sceneManager == NULL);
}

//------------------------------------------------------
// @brief	初期化
//------------------------------------------------------
int GameTask::Initialize()
{
	// DxLibの初期化処理
	if (DxLib_Init() == -1) {
		return -1;	// ｴﾗｰが起きたら終了
	}

	// 画面ﾓｰﾄﾞのｾｯﾄ
	SetGraphMode(640, 480, 16);		// (仮)
	ChangeWindowMode(TRUE);			// TRUE:ｳｨﾝﾄﾞｳ、FALSE:ﾌﾙｽｸﾘｰﾝ

	// SceneManagerを生成
	sceneManager = new SceneManager();

	return 0;
}

//------------------------------------------------------
// @brief	終了処理
//------------------------------------------------------
void GameTask::Finalize()
{
	// ↓他に削除するものがあれば書く
	delete(sceneManager);
	sceneManager = NULL;

	// DxLibの後始末
	DxLib_End();
}

//------------------------------------------------------
// @brief	更新
//------------------------------------------------------
void GameTask::Update()
{
	// ｼｰﾝ別の更新
	sceneManager->Update();
}

//------------------------------------------------------
// @brief	描画
//------------------------------------------------------
void GameTask::Draw()
{
	// 画面を初期化
	ClearDrawScreen();

	// ｼｰﾝ別の描画
	sceneManager->Draw();

	// 裏画面の内容を表面に反映させる
	ScreenFlip();
}