//------------------------------------------------------
// @brief	ﾓｰﾄﾞ選択画面
// 2020 5/7 Ryosuke Iida
//------------------------------------------------------

#include "ModeSelScene.h"
#include <DxLib.h>

//------------------------------------------------------
// @brief	ｺﾝｽﾄﾗｸﾀ
//------------------------------------------------------
ModeSelScene::ModeSelScene(ISceneSwitcher* switcher)
	: BaseScene(switcher)
{
	// 処理なし
}

//------------------------------------------------------
// @brief	ﾃﾞｽﾄﾗｸﾀ
//------------------------------------------------------
ModeSelScene::~ModeSelScene()
{
	// 処理なし
}

//------------------------------------------------------
// @brief	更新
//------------------------------------------------------
void ModeSelScene::Update(void)
{

	// ﾃﾞﾊﾞｯｸﾞ用ｼｰﾝ切り替えｷｰ:Q
	if (CheckHitKey(KEY_INPUT_Q) != 0) {
		// ｷｬﾗｸﾀｰ選択画面に切り替え
		sceneSwitcher->SwitchScene(eScene_CharSel);
	}
}

//------------------------------------------------------
// @brief	描画
//------------------------------------------------------
void ModeSelScene::Draw(void)
{
	DrawString(0, 0, "ﾓｰﾄﾞ選択画面", 0xffffff);
}
