//------------------------------------------------------
// @brief	ﾓｰﾄﾞ選択画面
// 2020 5/7 Ryosuke Iida
//------------------------------------------------------

#include <DxLib.h>
#include "ModeSelScene.h"
#include "Controller.h"

//------------------------------------------------------
// @brief	ｺﾝｽﾄﾗｸﾀ
//------------------------------------------------------
ModeSelScene::ModeSelScene(ISceneSwitcher* switcher)
	: BaseScene(switcher)
{
	// 処理なし
}

//------------------------------------------------------
// @brief	ﾃﾞｽﾄﾗｸﾀ
//------------------------------------------------------
ModeSelScene::~ModeSelScene()
{
	// 処理なし
}

//------------------------------------------------------
// @brief	初期化
//------------------------------------------------------
void ModeSelScene::Initialize()
{

}

//------------------------------------------------------
// @brief	終了処理
//------------------------------------------------------
void ModeSelScene::Finalize()
{

}

//------------------------------------------------------
// @brief	更新
//------------------------------------------------------
void ModeSelScene::Update()
{
	// ﾃﾞﾊﾞｯｸﾞ用ｼｰﾝ切り替えｷｰ:C
	if (lpController->IsPushD(INPUT_STATE::INPUT_TRG))
	{
		sceneSwitcher->SwitchScene(eScene_CharSel);	// ｷｬﾗｸﾀｰ選択画面に切り替え
	}
}

//------------------------------------------------------
// @brief	描画
//------------------------------------------------------
void ModeSelScene::Render()
{
	DS(0, 0, "ﾓｰﾄﾞ選択画面", 0xffffff);
}
