//------------------------------------------------------
// @brief	ﾌﾟﾚｲﾔｰと地形の当たり判定
// 2020 7/22 Ryosuke Iida
//------------------------------------------------------

#include "PlayerAndTerrain.h"

//------------------------------------------------------
// @brief	ｺﾝｽﾄﾗｸﾀ
//------------------------------------------------------
PlayerAndTerrain::PlayerAndTerrain()
{
	// 処理なし
}

//------------------------------------------------------
// @brief	ﾃﾞｽﾄﾗｸﾀ
//------------------------------------------------------
PlayerAndTerrain::~PlayerAndTerrain()
{
	// 処理なし
}

//------------------------------------------------------
// @brief	ﾌﾟﾚｲﾔｰと地形の判定処理
//------------------------------------------------------
bool PlayerAndTerrain::HitCheck(const ObjectType& o1, const ObjectType& o2)
{
	return false;
}