//------------------------------------------------------
// @brief	¼°İŠÔ‚ÌÃŞ°ÀŠÇ—
// 2020 6/17 Ryosuke Iida
//------------------------------------------------------

#include "SceneDateManager.h"

//------------------------------------------------------
// @brief	ºİ½Ä×¸À
//------------------------------------------------------
SceneDateManager::SceneDateManager()
{
	// ˆ—‚È‚µ
}

//------------------------------------------------------
// @brief	ÃŞ½Ä×¸À
//------------------------------------------------------
SceneDateManager::~SceneDateManager()
{
	// ˆ—‚È‚µ
}

//------------------------------------------------------
// @brief	‘I‚ñ‚¾½Ã°¼Ş‚ğ¾¯Ä
//------------------------------------------------------
void SceneDateManager::SetStageType(const STAGE_TYPE& type)
{
	stageType = type;
}

//------------------------------------------------------
// @brief	Ši”[‚µ‚½½Ã°¼ŞÀ²Ìß‚ğæ“¾
//------------------------------------------------------
const STAGE_TYPE SceneDateManager::GetStageType() const
{
	return stageType;
}